### Terraform Plan — `prod`

```
module.lambda.data.archive_file.lambda_package: Reading...
module.lambda.data.archive_file.lambda_package: Read complete after 0s [id=a90bae809f0cd89507b992a2b5355aaa53667485]
module.lambda.aws_iam_role.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load]
module.step_function.aws_cloudwatch_log_group.pipeline: Refreshing state... [id=/aws/stepfunction/doubleday-prod-pipeline]
module.lambda.aws_iam_role.silver_load: Refreshing state... [id=doubleday-prod-silver-load]
module.s3.aws_s3_bucket.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.glue.aws_glue_catalog_database.main: Refreshing state... [id=291743709387:doubleday_prod]
module.step_function.aws_iam_role.pipeline: Refreshing state... [id=doubleday-prod-pipeline]
module.lambda.aws_iam_role.validate_input: Refreshing state... [id=doubleday-prod-validate-input]
module.lambda.aws_iam_role.gold_load: Refreshing state... [id=doubleday-prod-gold-load]
module.lambda.aws_iam_role_policy.validate_input: Refreshing state... [id=doubleday-prod-validate-input:doubleday-prod-validate-input]
module.lambda.aws_lambda_function.validate_input: Refreshing state... [id=doubleday-prod-validate-input]
module.lambda.aws_lambda_function.silver_load: Refreshing state... [id=doubleday-prod-silver-load]
module.lambda.aws_lambda_function.gold_load: Refreshing state... [id=doubleday-prod-gold-load]
module.s3.aws_s3_bucket_public_access_block.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.s3.aws_s3_bucket_server_side_encryption_configuration.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.lambda.aws_iam_role_policy.gold_load: Refreshing state... [id=doubleday-prod-gold-load:doubleday-prod-gold-load]
module.glue.null_resource.silver_pitches_table: Refreshing state... [id=4478525258500367884]
module.lambda.aws_iam_role_policy.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load:doubleday-prod-bronze-load]
module.lambda.aws_iam_role_policy.silver_load: Refreshing state... [id=doubleday-prod-silver-load:doubleday-prod-silver-load]
module.glue.null_resource.gold_pitches_shape_season_table: Refreshing state... [id=3679298051484024578]
module.lambda.aws_lambda_function.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load]
module.glue.null_resource.silver_pitches_staging_table: Refreshing state... [id=1128037600232817712]
module.glue.aws_glue_catalog_table.bronze_statcast: Refreshing state... [id=291743709387:doubleday_prod:bronze_statcast]
module.step_function.aws_iam_role_policy.pipeline: Refreshing state... [id=doubleday-prod-pipeline:doubleday-prod-pipeline]
module.step_function.aws_sfn_state_machine.pipeline: Refreshing state... [id=arn:aws:states:us-east-1:291743709387:stateMachine:doubleday-prod-pipeline]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.glue.null_resource.silver_pitches_staging_table is tainted, so must be replaced
-/+ resource "null_resource" "silver_pitches_staging_table" {
      ~ id       = "1128037600232817712" -> (known after apply)
      ~ triggers = {
          ~ "sql_hash" = "c608b4ccff67d658cb2e2f3c4d790d2c" -> "5efbb4e17083c5f20b2433c063dff672"
        }
    }

  # module.lambda.aws_iam_role.clear_staging will be created
  + resource "aws_iam_role" "clear_staging" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "doubleday-prod-clear-staging"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda.aws_iam_role_policy.clear_staging will be created
  + resource "aws_iam_role_policy" "clear_staging" {
      + id          = (known after apply)
      + name        = "doubleday-prod-clear-staging"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "athena:StartQueryExecution",
                          + "athena:GetQueryExecution",
                          + "athena:GetQueryResults",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "glue:GetDatabase",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:UpdateTable",
                          + "glue:CreateTable",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:DeleteObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::doubleday-prod-lakehouse",
                          + "arn:aws:s3:::doubleday-prod-lakehouse/*",
                          + "arn:aws:s3:::appleforge-athena-query-results",
                          + "arn:aws:s3:::appleforge-athena-query-results/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.lambda.aws_lambda_function.bronze_load will be updated in-place
  ~ resource "aws_lambda_function" "bronze_load" {
        id                             = "doubleday-prod-bronze-load"
      ~ last_modified                  = "2026-02-13T22:48:09.315+0000" -> (known after apply)
      ~ source_code_hash               = "c38PvzPMh39RvInEqxjldvWnLC0+N7OVhaKtQzxH+aE=" -> "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.clear_staging will be created
  + resource "aws_lambda_function" "clear_staging" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambda/../../../builds/lambda_package.zip"
      + function_name                  = "doubleday-prod-clear-staging"
      + handler                        = "doubleday.lambdas.clear_staging.handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:017000801446:layer:AWSLambdaPowertoolsPythonV3-python312-x86_64:15",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ATHENA_OUTPUT_BUCKET"         = "appleforge-athena-query-results"
              + "GLUE_DATABASE"                = "doubleday_prod"
              + "POWERTOOLS_METRICS_NAMESPACE" = "Doubleday"
              + "POWERTOOLS_SERVICE_NAME"      = "clear_staging"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda.aws_lambda_function.gold_load will be updated in-place
  ~ resource "aws_lambda_function" "gold_load" {
        id                             = "doubleday-prod-gold-load"
      ~ last_modified                  = "2026-02-13T22:47:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "c38PvzPMh39RvInEqxjldvWnLC0+N7OVhaKtQzxH+aE=" -> "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.silver_load will be updated in-place
  ~ resource "aws_lambda_function" "silver_load" {
        id                             = "doubleday-prod-silver-load"
      ~ last_modified                  = "2026-02-13T22:47:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "c38PvzPMh39RvInEqxjldvWnLC0+N7OVhaKtQzxH+aE=" -> "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.validate_input will be updated in-place
  ~ resource "aws_lambda_function" "validate_input" {
        id                             = "doubleday-prod-validate-input"
      ~ last_modified                  = "2026-02-13T22:48:03.421+0000" -> (known after apply)
      ~ source_code_hash               = "c38PvzPMh39RvInEqxjldvWnLC0+N7OVhaKtQzxH+aE=" -> "x9AwDBvtHYUVh/3eE83J0mr9zWzkUC3Szoo1JMGJP8I="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.step_function.aws_iam_role_policy.pipeline will be updated in-place
  ~ resource "aws_iam_role_policy" "pipeline" {
        id          = "doubleday-prod-pipeline:doubleday-prod-pipeline"
        name        = "doubleday-prod-pipeline"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-validate-input",
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-bronze-load",
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-silver-load",
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-gold-load",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogDelivery",
                          - "logs:GetLogDelivery",
                          - "logs:UpdateLogDelivery",
                          - "logs:DeleteLogDelivery",
                          - "logs:ListLogDeliveries",
                          - "logs:PutResourcePolicy",
                          - "logs:DescribeResourcePolicies",
                          - "logs:DescribeLogGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.step_function.aws_sfn_state_machine.pipeline will be updated in-place
  ~ resource "aws_sfn_state_machine" "pipeline" {
      ~ definition                = jsonencode(
            {
              - Comment = "Doubleday ETL pipeline: validate → bronze → silver → gold"
              - StartAt = "ValidateInput"
              - States  = {
                  - BronzeLoadMap = {
                      - InputPath      = "$"
                      - ItemsPath      = "$.game_dates"
                      - Iterator       = {
                          - StartAt = "BronzeLoad"
                          - States  = {
                              - BronzeLoad = {
                                  - End        = true
                                  - Parameters = {
                                      - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-bronze-load"
                                      - "Payload.$"  = "$"
                                    }
                                  - Resource   = "arn:aws:states:::lambda:invoke"
                                  - ResultPath = "$.bronze_result"
                                  - Type       = "Task"
                                }
                            }
                        }
                      - MaxConcurrency = 5
                      - Next           = "SilverLoadMap"
                      - Parameters     = {
                          - "force_download.$" = "$.force_download"
                          - "game_date.$"      = "$$.Map.Item.Value"
                          - "season.$"         = "$.season"
                        }
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - GoldLoadMap   = {
                      - InputPath      = "$"
                      - ItemsPath      = "$.gold_tables"
                      - Iterator       = {
                          - StartAt = "GoldLoad"
                          - States  = {
                              - GoldLoad = {
                                  - End        = true
                                  - Parameters = {
                                      - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-gold-load"
                                      - "Payload.$"  = "$"
                                    }
                                  - Resource   = "arn:aws:states:::lambda:invoke"
                                  - ResultPath = "$.gold_result"
                                  - Type       = "Task"
                                }
                            }
                        }
                      - MaxConcurrency = 1
                      - Next           = "Succeed"
                      - Parameters     = {
                          - "season.$"     = "$.season"
                          - "table_name.$" = "$$.Map.Item.Value"
                        }
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - SetGoldTables = {
                      - Next       = "GoldLoadMap"
                      - Result     = [
                          - "gold_pitches_shape_season",
                        ]
                      - ResultPath = "$.gold_tables"
                      - Type       = "Pass"
                    }
                  - SilverLoadMap = {
                      - InputPath      = "$"
                      - ItemsPath      = "$.game_dates"
                      - Iterator       = {
                          - StartAt = "SilverLoad"
                          - States  = {
                              - SilverLoad = {
                                  - End        = true
                                  - Parameters = {
                                      - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-silver-load"
                                      - "Payload.$"  = "$"
                                    }
                                  - Resource   = "arn:aws:states:::lambda:invoke"
                                  - ResultPath = "$.silver_result"
                                  - Type       = "Task"
                                }
                            }
                        }
                      - MaxConcurrency = 5
                      - Next           = "SetGoldTables"
                      - Parameters     = {
                          - "partition_name.$" = "States.Format('season={}/game_date={}', $.season, $$.Map.Item.Value)"
                        }
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - Succeed       = {
                      - Type = "Succeed"
                    }
                  - ValidateInput = {
                      - Next           = "BronzeLoadMap"
                      - Parameters     = {
                          - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-validate-input"
                          - "Payload.$"  = "$"
                        }
                      - Resource       = "arn:aws:states:::lambda:invoke"
                      - ResultPath     = "$"
                      - ResultSelector = {
                          - "force_download.$" = "$.Payload.force_download"
                          - "game_dates.$"     = "$.Payload.game_dates"
                          - "season.$"         = "$.Payload.season"
                        }
                      - Type           = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id                        = "arn:aws:states:us-east-1:291743709387:stateMachine:doubleday-prod-pipeline"
        name                      = "doubleday-prod-pipeline"
        tags                      = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 6 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

*Triggered by @dcbove in #6*